#include "SPI.h"

/**************************************************************************
*名称：MSPI——Init
*功能：初始化SPI接口，设置为主机
*入口参数：无
*出口参数：无
***************************************************************************/
 void  MSPI_Init(void )
 {
 	PINSEL0=(PINSEL0&0xFFFF00FF)|0x00005500;	 //引脚设置连接SIP
   	PINSEL1 =( PINSEL1&0xF3FFFFFF);              //P0.29使能为GPIO
   	IO0DIR = SPI_CS;	                         //设置SPI等控制口为输出
	S0PCCR=0x52;							     //设置SPI时钟分频
	S0PCR =(0<<3)|								 //CPHA=0，数据在第一个时钟沿采样
		  (1<<4)|								 //CPOL=1，SCK低有效
		  (1<<5)|								 //MSTR=1，SPI处于主模式
		  (0<<6)|								 //LSBF=0,SPI数据传输MSB（bit7）在先
		  (0<<7);								 //SPIE=0，SPI中断被禁止
}

/***************************************************************************
* 名称：HC595_SendDat()
* 功能：向74HC595发送一字节数据
* 入口参数：dat		要发送的数据
* 出口参数：返回值为读取的数据
* 说明：发送数据时，高位先发送。
****************************************************************************/
uint8 MSPI_SendData(uint8 dat)
{  
   	//IO0CLR = SPI_CS;			    	// SPI_CS = 0	RT12864片选为高有效，故不用拉低
   	SPI_SPDR=dat;
	while( 0== (S0PSR&0x80));		    //等待数据发送完毕
	//IO0SET=SPI_CS;
	return  (SPI_SPDR);

}
